# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [ ]:
#Your code here
import sqlite3
connection = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = connection.cursor()

In [36]:
import pandas as pd

def sql_run(query):
    return pd.DataFrame(cur.execute(query).fetchall())

## Display the names of all the employees in Boston.

In [37]:
#Your code here
sql_run('''SELECT firstName, lastName
                FROM employees
                JOIN offices
                USING(officeCode)
                WHERE city = 'Boston';''')

       0          1
0  Julie   Firrelli
1  Steve  Patterson

## Do any offices have no employees?

In [38]:
#Your code here
sql_run('''SELECT offices.City, COUNT(*)
           FROM employees
           LEFT JOIN offices
           USING(officeCode)
           GROUP BY offices.officeCode;
        ''')

               0  1
0  San Francisco  6
1         Boston  2
2            NYC  2
3          Paris  5
4          Tokyo  2
5         Sydney  4
6         London  2

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary

In [43]:
# Your code here
# Sale results per rep
sql_run('''SELECT e.firstName, e.lastName, SUM(p.amount) as total_sales
           FROM employees e
           JOIN customers c ON e.employeeNumber = salesRepEmployeeNumber
           JOIN payments p USING(customerNumber)
           GROUP BY e.lastName
           ORDER BY total_sales DESC
           LIMIT 10;
            ''')

          0          1           2
0    Gerard  Hernandez  1112003.81
1    Leslie   Jennings   989906.55
2    Pamela   Castillo   750201.87
3     Larry       Bott   686653.25
4     Barry      Jones   637672.65
5    George     Vanauf   584406.80
6      Loui     Bondur   569485.75
7      Andy     Fixter   509385.82
8     Peter      Marsh   497907.16
9  Foon Yue      Tseng   488212.67

In [49]:
# Your code here
# Customers largest orders
sql_run('''SELECT c.customerName, MAX(p.amount)
           FROM customers c
           JOIN payments p USING(customerNumber)
           GROUP BY customerName
           ORDER BY MAX(p.amount) DESC
           LIMIT 10;
            ''')

                              0         1
0              FunGiftIdeas.com   9977.85
1   Australian Gift Network, Co   9821.32
2       Auto-Moto Classics Inc.   9658.74
3  Australian Collectables, Ltd   9415.13
4               Mini Auto Werke   8807.12
5      Corporate Gift Ideas Co.  85559.12
6  Mini Gifts Distributors Ltd.  85410.87
7                  Herkku Gifts  85024.46
8           Mini Creations Ltd.   8307.28
9    Australian Collectors, Co.  82261.22

In [51]:
# Your code here
# Most ordered product
sql_run('''SELECT p.productName, COUNT(*) as Total
           FROM products p 
           JOIN orderdetails
           USING(productCode)
           GROUP BY p.productName
           ORDER BY Total DESC
           LIMIT 10;
            ''')

                                     0   1
0          1992 Ferrari 360 Spider red  53
1  18th Century Vintage Horse Carriage  28
2               1900s Vintage Bi-Plane  28
3              1900s Vintage Tri-Plane  28
4          1913 Ford Model T Speedster  28
5             1917 Maxwell Touring Car  28
6                1926 Ford Fire Engine  28
7     1928 British Royal Navy Airplane  28
8             1928 Ford Phaeton Deluxe  28
9               1928 Mercedes-Benz SSK  28

## Level Up: Display the names of each product each employee has sold.

In [53]:
# Your code here
sql_run('''SELECT e.firstName, e.lastName, p.productName
           FROM employees e
           JOIN customers c ON e.employeeNumber = salesRepEmployeeNumber
           JOIN orders USING(customerNumber)
           JOIN orderdetails USING(orderNumber)
           JOIN products p USING(productCode)
           ;''')

           0         1                                            2
0     Leslie  Jennings                               1958 Setra Bus
1     Leslie  Jennings                       1940 Ford Pickup Truck
2     Leslie  Jennings                      1939 Cadillac Limousine
3     Leslie  Jennings  1996 Peterbilt 379 Stake Bed with Outrigger
4     Leslie  Jennings                            1968 Ford Mustang
5     Leslie  Jennings                           1968 Dodge Charger
6     Leslie  Jennings                      1970 Plymouth Hemi Cuda
7     Leslie  Jennings                           1969 Dodge Charger
8     Leslie  Jennings                  1948 Porsche 356-A Roadster
9     Leslie  Jennings                         1969 Dodge Super Bee
10    Leslie  Jennings                        1976 Ford Gran Torino
11    Leslie  Jennings                             1957 Vespa GS150
12    Leslie  Jennings                    1957 Corvette Convertible
13    Leslie  Jennings                      1982 Ducati 900 Monster
14    Leslie  Jennings                      1982 Lamborghini Diablo
15    Leslie  Jennings                    1971 Alpine Renault 1600s
16    Leslie  Jennings                      1956 Porsche 356A Coupe
17    Leslie  Jennings                        1961 Chevrolet Impala
18    Leslie  Jennings                            1982 Ducati 996 R
19    Leslie  Jennings                    1974 Ducati 350 Mk3 Desmo
20    Leslie  Jennings                           2002 Yamaha YZR M1
21    Leslie  Jennings                            2001 Ferrari Enzo
22    Leslie  Jennings                           1969 Corvair Monza
23    Leslie  Jennings                             1969 Ford Falcon
24    Leslie  Jennings                            1903 Ford Model A
25    Leslie  Jennings                     Collectable Wooden Train
26    Leslie  Jennings                        1970 Triumph Spitfire
27    Leslie  Jennings                          1904 Buick Runabout
28    Leslie  Jennings                        18th century schooner
29    Leslie  Jennings             1912 Ford Model T Delivery Wagon
...      ...       ...                                          ...
2966  Martin    Gerard                     1917 Grand Touring Sedan
2967  Martin    Gerard                           1911 Ford Town Car
2968  Martin    Gerard                    1932 Model A Ford J-Coupe
2969  Martin    Gerard                       1928 Mercedes-Benz SSK
2970  Martin    Gerard                  1939 Chevrolet Deluxe Coupe
2971  Martin    Gerard    1938 Cadillac V-16 Presidential Limousine
2972  Martin    Gerard             1936 Mercedes Benz 500k Roadster
2973  Martin    Gerard                            2001 Ferrari Enzo
2974  Martin    Gerard                           1969 Corvair Monza
2975  Martin    Gerard                      1939 Cadillac Limousine
2976  Martin    Gerard                     1962 Volkswagen Microbus
2977  Martin    Gerard                        1936 Chrysler Airflow
2978  Martin    Gerard                  1980’s GM Manhattan Express
2979  Martin    Gerard  1996 Peterbilt 379 Stake Bed with Outrigger
2980  Martin    Gerard                              1982 Camaro Z28
2981  Martin    Gerard                            1957 Chevy Pickup
2982  Martin    Gerard               1998 Chrysler Plymouth Prowler
2983  Martin    Gerard                       1964 Mercedes Tour Bus
2984  Martin    Gerard                        1926 Ford Fire Engine
2985  Martin    Gerard                  1992 Ferrari 360 Spider red
2986  Martin    Gerard                           1970 Dodge Coronet
2987  Martin    Gerard                     1962 Volkswagen Microbus
2988  Martin    Gerard          1958 Chevy Corvette Limited Edition
2989  Martin    Gerard            1992 Porsche Cayenne Turbo Silver
2990  Martin    Gerard                  1980’s GM Manhattan Express
2991  Martin    Gerard                  1954 Greyhound Scenicruiser
2992  Martin    Gerard       1950's Chicago Surface Lines Streetcar
2993  Martin    Gerard             Diamond T620 Semi-Skirted Tanker
2994  Martin    Gerard                           1911 Ford Town Car
2995  Martin    Gerard             1936 Mercedes Benz 500k Roadster

[2996 rows x 3 columns]

## Level Up: Display the Number of Products each Employee Has sold

In [ ]:
#Your code here

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!